app/controllers/posts_controller.rb

  def create
  Post.create(title: params[:post][:title], description: params[:post][:description])
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "{\"title\"=>\"My post title\", \"description\"=>\"My post description\"}"], ["created_at", "2018-07-12 13:53:14.307237"], ["updated_at", "2018-07-12 13:53:14.307237"]]